# Heros Of Pymoli

After a lot of hard work in the data munging mines, you've landed a job as Lead Analyst for an independent gaming company. The assigned  task is to analyze the data for their most recent fantasy game Heroes of Pymoli. 

Like many others in its genre, the game is free-to-play, but players are encouraged to purchase optional items that enhance their playing experience. As a first task, the company would like you to generate a report that breaks down the game's purchasing data into meaningful insights.

As the first step, the needed packages as imported. Since data file is json, we need to import json package .

In [54]:
import pandas as pd
import os
import json

In [115]:
purchase_Data_Reader1=reading_File(os.path.join("raw_data","purchase_data2.json"))
purchase_Data_Reader2=reading_File(os.path.join("raw_data","purchase_data.json"))
purchase_Data_Reader=pd.concat([purchase_Data_Reader1,purchase_Data_Reader2])
purchase_Data_Reader.head()

   Age Gender  Item ID                 Item Name  Price          SN
0   20   Male       93  Apocalyptic Battlescythe   4.49     Iloni35
1   21   Male       12                     Dawne   3.36   Aidaira26
2   17   Male        5                Putrid Fan   2.63      Irim47
3   17   Male      123         Twilight's Carver   2.55     Irith83
4   22   Male      154              Feral Katana   4.11  Philodil43


## Total Players

In [117]:
total_players=players_count()
total_players

   Total Players
0            858

## Purchase Analysis Total

In [119]:
total_analysis_df=total_analysis()
total_analysis_df

   No.of Unique Items  Average Price  No.of Purchases  Total Revenue
0                  93      27.036882              858        2514.43

## <li><u><i>Gender Demographics</i></u>

In [121]:
total_Gender=gender_total()
total_Gender.head()

                  Gender  Percentage Players  Total Count
0                   Male               81.24          697
1                 Female               17.37          149
2  Other / Non-Disclosed                1.40           12

 ##  <li><u><i>Purchasing Analysis (Gender) </i></u>

##  <li><u><i>Age Demographics </i></u>

In [123]:
gender_Analyis=gender_Analysis()
gender_Analyis

,Gender,Purchase Count,Average Purchase Price,Total Purchase Value,Normalized Totals
0,Male,697,2.944448,2052.28,2.944448
1,Female,149,2.847584,424.29,2.847584
2,Other / Non-Disclosed,12,3.155000,37.86,3.155000

## Top Spenders

In [126]:
age_df=age_group("Age Group")
age_df=age_df.dropna(how="any")
age_df

C:\Users\Aswathy Vineeth\Anaconda3\lib\site-packages\ipykernel_launcher.py:9: RuntimeWarning: invalid value encountered in long_scalars
  if __name__ == '__main__':
C:\Users\Aswathy Vineeth\Anaconda3\lib\site-packages\ipykernel_launcher.py:11: RuntimeWarning: invalid value encountered in long_scalars
  # This is added back by InteractiveShellApp.init_path()

,Age Group Range,Purchase Count,Average PRICE,Total Price,Normalized Total
0,20-25,372,2.923817,1087.66,2.923817
1,15-19,144,2.894653,416.83,2.894653
2,<10,37,2.984865,110.44,2.984865
3,40-44,17,3.275294,55.68,3.275294
4,25-29,134,2.958507,396.44,2.958507
5,35-39,48,2.932708,140.77,2.932708
6,30-34,71,2.973803,211.14,2.973803
7,10-14,34,2.727941,92.75,2.727941

In [128]:
new_data=analysis_final(purchase_Data_Reader,"SN","Price")
new_data

              SN  Purchase Count  Avg Purchase Price  Total Purchase
0    Undirrala66               5                3.41           17.06
1  Aerithllora36               4                3.78           15.10
2       Saedue76               4                3.39           13.56
3       Sondim43               4                3.26           13.02
4    Mindimnya67               4                3.18           12.74

## Popular and Profitable Items

### Most Popular Items

In [130]:
purchase_df=purchase_count()
# create the df by calling function and sort based on Purchase count
purchase_df=purchase_df.sort_values("Purchase Count",ascending=False)
purchase_df.head()

,Item ID,Purchase Count,Item Name,Price,Total Purchase Value
44,84,12,Arcane Gem,4.81,29.34
104,39,11,"Betrayal, Whisper of Grieving Widows",2.35,25.85
53,31,10,Trickster,4.59,23.22
14,44,9,Bonecarvin Battle Axe,4.36,24.04
33,108,9,"Extraction, Quickblade Of Trembling Hands",2.26,28.25

### Most Profitable Items

In [131]:
total_purchase=purchase_count()
# create the df by calling function and sort based on Total Purchase Value
total_purchase=total_purchase.sort_values("Total Purchase Value",ascending=False)
total_purchase.head()

,Item ID,Purchase Count,Item Name,Price,Total Purchase Value
102,34,9,Retribution Axe,4.14,37.26
49,107,9,"Splitter, Foe Of Subtlety",4.15,33.03
124,115,7,Spectral Diamond Doomblade,4.25,29.75
98,32,6,Orenmir,4.95,29.70
44,84,12,Arcane Gem,4.81,29.34